Revit 2024 API
FilterElementIdRule Methods
The FilterElementIdRule type exposes the following members.
Methods
Name | Description
Dispose |  (Inherited from FilterRule.)
ElementPasses
 Derived classes override this method to implement the test that determines whether the given element passes this rule or not.
 (Inherited from FilterRule.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetEvaluator
 Gets the evaluator that implements the test for this rule.
 (Inherited from FilterNumericValueRule.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetRuleParameter
 Returns the ElementId of the parameter associated to this FilterRule if there is one, or invalidElementId if there is no associated parameter.
 (Inherited from FilterRule.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
SetEvaluator
 Sets the evaluator that implements the test for this rule.
 (Inherited from FilterNumericValueRule.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
UsesLevelFiltering
 This function checks if a parameter uses level filtering.
See Also
FilterElementIdRule Class
Autodesk.Revit.DB Namespace